## Abrindo arquivos json e sorteando nomes

In [157]:
import pandas as pd

In [158]:
nomes_feminio = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=f')
nomes_masculino = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=m')

In [159]:
nomes_feminio

         nome  regiao      freq  rank sexo
0       MARIA       0  11694738     1    F
1         ANA       0   3079729     2    F
2   FRANCISCA       0    721637     3    F
3     ANTONIA       0    588783     4    F
4     ADRIANA       0    565621     5    F
5     JULIANA       0    562589     6    F
6      MARCIA       0    551855     7    F
7    FERNANDA       0    531607     8    F
8    PATRICIA       0    529446     9    F
9       ALINE       0    509869    10    F
10     SANDRA       0    479230    11    F
11     CAMILA       0    469851    12    F
12     AMANDA       0    464624    13    F
13      BRUNA       0    460770    14    F
14    JESSICA       0    456472    15    F
15    LETICIA       0    434056    16    F
16      JULIA       0    430067    17    F
17    LUCIANA       0    429769    18    F
18    VANESSA       0    417512    19    F
19    MARIANA       0    381778    20    F

In [160]:
nomes_masculino

         nome  regiao     freq  rank sexo
0        JOSE       0  5732508     1    M
1        JOAO       0  2971935     2    M
2     ANTONIO       0  2567494     3    M
3   FRANCISCO       0  1765197     4    M
4      CARLOS       0  1483121     5    M
5       PAULO       0  1417907     6    M
6       PEDRO       0  1213557     7    M
7       LUCAS       0  1116818     8    M
8        LUIZ       0  1102927     9    M
9      MARCOS       0  1101126    10    M
10       LUIS       0   931530    11    M
11    GABRIEL       0   922744    12    M
12     RAFAEL       0   814709    13    M
13     DANIEL       0   706527    14    M
14    MARCELO       0   690098    15    M
15      BRUNO       0   663271    16    M
16    EDUARDO       0   628539    17    M
17     FELIPE       0   615924    18    M
18   RAIMUNDO       0   611174    19    M
19    RODRIGO       0   598825    20    M

#### Sorteando 5 nomes Feminios:

In [161]:
nomes_feminio.sample(5)

         nome  regiao      freq  rank sexo
1         ANA       0   3079729     2    F
2   FRANCISCA       0    721637     3    F
12     AMANDA       0    464624    13    F
4     ADRIANA       0    565621     5    F
0       MARIA       0  11694738     1    F

#### Sorteando 5 nomes masculinos:

In [162]:
nomes_masculino.sample(5)

       nome  regiao     freq  rank sexo
7     LUCAS       0  1116818     8    M
11  GABRIEL       0   922744    12    M
13   DANIEL       0   706527    14    M
14  MARCELO       0   690098    15    M
10     LUIS       0   931530    11    M

#### Quantidade de nomes em cada variavel:

In [163]:
len(nomes_feminio)

20

In [164]:
len(nomes_masculino)

20

In [165]:
nomes_feminio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    20 non-null     object
 1   regiao  20 non-null     int64
 2   freq    20 non-null     int64
 3   rank    20 non-null     int64
 4   sexo    20 non-null     object
dtypes: int64(3), object(2)
memory usage: 928.0+ bytes

#### Armazenando os dois DataFrames de nomes em uma variavel:

In [166]:
frame = [nomes_feminio, nomes_masculino]

#### Juntando os dois Dataframes:
- somente o campo nome
- to_frame() -> salvando em um novo DataFrame
- sample(5) -> sorteando 5 nomes aleatorios

In [167]:
nomes = pd.concat(frame)['nome'].to_frame()

In [168]:
nomes.sample(5)

       nome
14  JESSICA
12   AMANDA
15  LETICIA
19  RODRIGO
0     MARIA

# Incluindo ID dos alunos

#### Importando a biblioteca numpy para gerar números aleatórios

In [169]:
import numpy as np

In [170]:
np.random.seed(123)

In [171]:
# Iserindo a coluna Id_aluno que será aleatoria:

nomes['Id_aluno'] = np.random.permutation(len(nomes)) + 1

In [172]:
# Criando uma coluna chamada Id:
nomes.columns.name = 'Id'

In [173]:
# Alterando o indice da coluna Id para quantidade de nomes em ordem crescente:
nomes.index = range(nomes.shape[0])

In [174]:
nomes.sample(5)

Id      nome  Id_aluno
8   PATRICIA        14
35     BRUNO        20
20      JOSE        26
31   GABRIEL        37
28      LUIZ        10

## Criando dois dominios de email:

In [175]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']

## Criando as colunas: dominio e email
- Criar no DataFrame nomes a coluna dominio, que vai receber np. aleatorio, e o método choice e sortear os dominios da variavels dominios ate o tamanho do DataFrame nomes

In [176]:
nomes['dominio'] = np.random.choice(dominios, len(nomes))

In [177]:
nomes.sample(10)

Id       nome  Id_aluno                 dominio
34    MARCELO        23  @dominiodoemail.com.br
2   FRANCISCA        13     @servicodoemail.com
32     RAFAEL        33     @servicodoemail.com
9       ALINE        21     @servicodoemail.com
11     CAMILA        38  @dominiodoemail.com.br
23  FRANCISCO        36     @servicodoemail.com
37     FELIPE        35  @dominiodoemail.com.br
26      PEDRO        15  @dominiodoemail.com.br
14    JESSICA        19     @servicodoemail.com
39    RODRIGO         3     @servicodoemail.com

## Juntando os dominios com os nomes do alunos
- Criando a coluna email, que recebe a coluna nome, passando para string, concatenando com a coluna dominio, e passando toda a string para minusculo

In [178]:
nomes['email'] = nomes['nome'].str.cat(nomes['dominio']).str.lower()

In [179]:
nomes.sample(10)

Id      nome  Id_aluno                 dominio                          email
4    ADRIANA         6  @dominiodoemail.com.br  adriana@dominiodoemail.com.br
0      MARIA         7  @dominiodoemail.com.br    maria@dominiodoemail.com.br
33    DANIEL        34  @dominiodoemail.com.br   daniel@dominiodoemail.com.br
15   LETICIA        40     @servicodoemail.com     leticia@servicodoemail.com
11    CAMILA        38  @dominiodoemail.com.br   camila@dominiodoemail.com.br
24    CARLOS        30  @dominiodoemail.com.br   carlos@dominiodoemail.com.br
38  RAIMUNDO        29     @servicodoemail.com    raimundo@servicodoemail.com
21      JOAO         5     @servicodoemail.com        joao@servicodoemail.com
18   VANESSA        22     @servicodoemail.com     vanessa@servicodoemail.com
28      LUIZ        10     @servicodoemail.com        luiz@servicodoemail.com

# Criando a Tabela Cursos

#### Instalando duas bibliotecas:
- !pip3 install html5lib
- !pip3 install lxml

In [181]:
!pip3 install html5lib
!pip3 install lxml

Requirement already satisfied: html5lib in c:\users\thyci\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\users\thyci\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\thyci\anaconda3\lib\site-packages (from html5lib) (1.15.0)
Requirement already satisfied: lxml in c:\users\thyci\anaconda3\lib\site-packages (4.6.3)

#### Importando as duas bibliotecas

In [183]:
import html5lib

In [187]:
# Passando a url da lista de cursos para a variavel:
url = 'http://tabela-cursos.herokuapp.com/index.html'

In [190]:
# Atribuindo a leitura da url a uma variavel Lendo essa página html, ela retorna uma lista:
cursos = pd.read_html(url)
cursos

[                          Nome do curso
 0                 Lógica de programação
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integrações com Java
 8                          TDD com Java
 9                   Código limpo com C#
 10  Preparatório para certificação Java
 11                      Hardware básico
 12                Persistência com .NET
 13                  Desenvolvendo jogos
 14                     Análise de dados
 15                   Estatística básica
 16                  Internet das coisas
 17                Programação funcional
 18                Boas práticas em Java
 19          Orientação objetos com Java]

In [192]:
type(cursos)

list

#### Transformando cursos que é uma lista em um DataFrame:

In [198]:
cursos = cursos[0]

                          Nome do curso
0                 Lógica de programação
1                         Java para Web
2                           C# para Web
3                         Ruby on Rails
4                      Cursos de Python
5                         PHP com MySql
6                         .NET para web
7            Novas integrações com Java
8                          TDD com Java
9                   Código limpo com C#
10  Preparatório para certificação Java
11                      Hardware básico
12                Persistência com .NET
13                  Desenvolvendo jogos
14                     Análise de dados
15                   Estatística básica
16                  Internet das coisas
17                Programação funcional
18                Boas práticas em Java
19          Orientação objetos com Java

In [200]:
type(cursos)

pandas.core.frame.DataFrame

In [201]:
cursos.head()

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python

### Alterando o index dos cursos

In [205]:
cursos = cursos.rename(columns={'Nome do curso': 'Nome_do_curso'})
cursos

                          Nome_do_curso
0                 Lógica de programação
1                         Java para Web
2                           C# para Web
3                         Ruby on Rails
4                      Cursos de Python
5                         PHP com MySql
6                         .NET para web
7            Novas integrações com Java
8                          TDD com Java
9                   Código limpo com C#
10  Preparatório para certificação Java
11                      Hardware básico
12                Persistência com .NET
13                  Desenvolvendo jogos
14                     Análise de dados
15                   Estatística básica
16                  Internet das coisas
17                Programação funcional
18                Boas práticas em Java
19          Orientação objetos com Java

### Criando um id dos cursos

In [206]:
cursos['id'] = cursos.index + 1

In [207]:
cursos

                          Nome_do_curso  id
0                 Lógica de programação   1
1                         Java para Web   2
2                           C# para Web   3
3                         Ruby on Rails   4
4                      Cursos de Python   5
5                         PHP com MySql   6
6                         .NET para web   7
7            Novas integrações com Java   8
8                          TDD com Java   9
9                   Código limpo com C#  10
10  Preparatório para certificação Java  11
11                      Hardware básico  12
12                Persistência com .NET  13
13                  Desenvolvendo jogos  14
14                     Análise de dados  15
15                   Estatística básica  16
16                  Internet das coisas  17
17                Programação funcional  18
18                Boas práticas em Java  19
19          Orientação objetos com Java  20

### Colocando a coluna id no lugar da indice:

In [208]:
cursos = cursos.set_index('id')

In [209]:
cursos

                          Nome_do_curso
id
1                 Lógica de programação
2                         Java para Web
3                           C# para Web
4                         Ruby on Rails
5                      Cursos de Python
6                         PHP com MySql
7                         .NET para web
8            Novas integrações com Java
9                          TDD com Java
10                  Código limpo com C#
11  Preparatório para certificação Java
12                      Hardware básico
13                Persistência com .NET
14                  Desenvolvendo jogos
15                     Análise de dados
16                   Estatística básica
17                  Internet das coisas
18                Programação funcional
19                Boas práticas em Java
20          Orientação objetos com Java